plebioda/hdmisnoop/platform/inc/stm32_usb_fs.h
#ifndef _STM32_USB_FS_H
#define _STM32_USB_FS_H

#include <stm32f4xx.h>

#define USB_OTG_FS_BASE			(AHB2PERIPH_BASE + 0x00000000)
#define USB_OTG_FS_CGCSR_BASE		(USB_OTG_FS_BASE + 0x00000000)
#define USB_OTG_FS_HMCSR_BASE		(USB_OTG_FS_BASE + 0x00000400)
#define USB_OTG_FS_DMCSR_BASE		(USB_OTG_FS_BASE + 0x00000800)
#define USB_OTG_FS_DIEPCTL0_BASE	(USB_OTG_FS_BASE + 0x00000900)
#define USB_OTG_FS_DIEPCTLx_BASE(x)	(USB_OTG_FS_DIEPCTL0_BASE + (x)*0x20)
#define USB_OTG_FS_DIEPINT0_BASE	(USB_OTG_FS_BASE + 0x00000908)
#define USB_OTG_FS_DIEPINTx_BASE(x)	(USB_OTG_FS_DIEPINT0_BASE + (x)*0x20)
#define USB_OTG_FS_DIEPSIZ0_BASE	(USB_OTG_FS_BASE + 0x00000910)
#define USB_OTG_FS_DIEPSIZx_BASE(x)	(USB_OTG_FS_DIEPSIZ0_BASE + (x)*0x20)
#define USB_OTG_FS_DTXFSTS0_BASE	(USB_OTG_FS_BASE + 0x00000918)
#define USB_OTG_FS_DTXFSTSx_BASE(x)	(USB_OTG_FS_DTXFSTS0_BASE + (x)*0x20)
#define USB_OTG_FS_DOEPCTL0_BASE	(USB_OTG_FS_BASE + 0x00000B00)
#define USB_OTG_FS_DOEPCTLx_BASE(x)	(USB_OTG_FS_DOEPCTL0_BASE + (x)*0x20)
#define USB_OTG_FS_DOEPINT0_BASE	(USB_OTG_FS_BASE + 0x00000B08)
#define USB_OTG_FS_DOEPINTx_BASE(x)	(USB_OTG_FS_DOEPINT0_BASE + (x)*0x20)
#define USB_OTG_FS_DOEPSIZ0_BASE	(USB_OTG_FS_BASE + 0x00000B10)
#define USB_OTG_FS_DOEPSIZx_BASE(x)	(USB_OTG_FS_DOEPSIZ0_BASE + (x)*0x20)
#define USB_OTG_FS_PCGCCTL_BASE		(USB_OTG_FS_BASE + 0x00000E00)
#define USB_OTG_FS_DFIFO0_BASE		(USB_OTG_FS_BASE + 0x00001000)
#define USB_OTG_FS_DFIFOx_BASE(x)	(USB_OTG_FS_DFIFO0_BASE + (x)*0x1000)

#define USB_OTG_FS_CGCSR		((USB_OTG_FS_CGCSR_T*)USB_OTG_FS_CGCSR_BASE)
#define USB_OTG_FS_HMCSR		((USB_OTG_FS_HMCSR_T*)USB_OTG_FS_HMCSR_BASE)
#define USB_OTG_FS_DMCSR		((USB_OTG_FS_DMCSR_T*)USB_OTG_FS_DMCSR_BASE)
#define USB_OTG_FS_DIEPCTL0		((USB_OTG_FS_DIEPCTL0_T*)USB_OTG_FS_DIEPCTL0_BASE)
#define USB_OTG_FS_DIEPCTL(x)		((USB_OTG_FS_DIEPCTLx_T*)USB_OTG_FS_DIEPCTLx_BASE((x)))
#define USB_OTG_FS_DIEPINT0		((USB_OTG_FS_DIEPINTx_T*)USB_OTG_FS_DIEPINT0_BASE)
#define USB_OTG_FS_DIEPINT(x)		((USB_OTG_FS_DIEPINTx_T*)USB_OTG_FS_DIEPINTx_BASE((x)))
#define USB_OTG_FS_DIEPSIZ0		((USB_OTG_FS_DIEPSIZ0_T*)USB_OTG_FS_DIEPSIZ0_BASE)
#define USB_OTG_FS_DIEPSIZ(x)		((USB_OTG_FS_DIEPSIZx_T*)USB_OTG_FS_DIEPSIZx_BASE((x)))
#define USB_OTG_FS_DTXFSTS0		((USB_OTG_FS_DTXFSTSx_T*)USB_OTG_FS_DTXFSTS0_BASE)
#define USB_OTG_FS_DTXFSTS(x)		((USB_OTG_FS_DTXFSTSx_T*)USB_OTG_FS_DTXFSTSx_BASE((x)))
#define USB_OTG_FS_DOEPCTL0		((USB_OTG_FS_DOEPCTL0_T*)USB_OTG_FS_DOEPCTL0_BASE)
#define USB_OTG_FS_DOEPCTL(x)		((USB_OTG_FS_DOEPCTLx_T*)USB_OTG_FS_DOEPCTLx_BASE((x)))
#define USB_OTG_FS_DOEPINT0		((USB_OTG_FS_DOEPINTx_T*)USB_OTG_FS_DOEPINT0_BASE)
#define USB_OTG_FS_DOEPINT(x)		((USB_OTG_FS_DOEPINTx_T*)USB_OTG_FS_DOEPINTx_BASE((x)))
#define USB_OTG_FS_DOEPSIZ0		((USB_OTG_FS_DOEPSIZ0_T*)USB_OTG_FS_DOEPSIZ0_BASE)
#define USB_OTG_FS_DOEPSIZ(x)		((USB_OTG_FS_DOEPSIZx_T*)USB_OTG_FS_DOEPSIZx_BASE((x)))
#define USB_OTG_FS_PCGCCTL		((USB_OTG_FS_PCGCCTL_T*)USB_OTG_FS_PCGCCTL_BASE)
#define USB_OTG_FS_DFIFO(x)		((uint32_t*)USB_OTG_FS_DFIFOx_BASE((x)))

#define USB_OTG_FS_DEVICE_MODE_FIFO_NUM		3
#define USB_OTG_FS_HOST_MODE_FIFO_NUM		7

typedef union
{
	uint32_t reg;
	struct
	{
		uint32_t SRQSCS 	: 1;	/* Bit 0      : Session request success */
		uint32_t SRQ		: 1;	/* Bit 1      : Session request */
		uint32_t reserved_7_2	: 6;	/* Bits 7:2   : reserved */
		uint32_t HNGSCS		: 1;	/* Bit 8      : Host negotiation success */
		uint32_t HNPRQ		: 1;	/* Bit 9      : HNP request */
		uint32_t HSHNPEN	: 1; 	/* Bit 10     : host set HNP enable */
		uint32_t DHNPEN		: 1;	/* Bit 11     : device HDP enabled */
		uint32_t reserved_15_12 : 4;	/* Bits 15:12 : reserved */
		uint32_t CIDSTS		: 1;	/* Bit 16     : Connector ID status */
		uint32_t DBCT		: 1; 	/* Bit 17     : Long/short debounce time */
		uint32_t ASVLD		: 1;	/* Bit 18     : A-session valid */
		uint32_t BSVLD		: 1; 	/* Bit 19     : B-session valid */
		uint32_t reserved_31_20 :11;	/* Bits 31:20 : reserved */
	} b;
} USB_OTG_FS_GOTGCTL_T;

typedef union
{
	uint32_t reg;
	struct
	{
		uint32_t reserved_1_0	: 2;	/* Bits 1:0   : reserved */
		uint32_t SEDET		: 1;	/* Bit 2      : Session end detected */
		uint32_t reserved_7_3	: 5;	/* Bits 7:3   : reserved */
		uint32_t SRSSCHG	: 1; 	/* Bit 8      : Session request success status change */
		uint32_t HNSSCHG	: 1; 	/* Bit 9      : host negotiation success status change */
		uint32_t reserved_16_10 : 7;	/* Bits 16:10 : reserved */
		uint32_t HNGDET		: 1; 	/* Bit 17     : Host negotiation detect */
		uint32_t ADTOCHG	: 1;	/* Bit 18     : A-device timeout change */
		uint32_t DBCDNE		: 1;	/* Bit 19     : Debounce done */
		uint32_t reserved_31_20 :11;	/* Bits 31:20 : reserved */	
	} b;
} USB_OTG_FS_GOTGINT_T;

typedef union
{
	uint32_t reg;
	struct
	{
		uint32_t GINTMSK	: 1;	/* Bit 0      : Global interrupt mask */
		uint32_t reserved_6_1	: 6;	/* Bits 6:1   : reserved */
		uint32_t TXFELVL	: 1;	/* Bit 7      : Tx FIFO empty level */
		uint32_t PTXFELVL	: 1;	/* Bit 8      : Periodic Tx FIFO empty level */
		uint32_t reserved_31_9  :23;	/* Bits 31:9  : reserved */
	} b;
} USB_OTG_FS_GAHBCFG_T;

typedef union
{
	uint32_t reg;
	struct
	{
		uint32_t TOCAL		: 3;	/* Bits 2:0   : FS timeout calibration */
		uint32_t reserved_5_3	: 3;	/* Bits 5:3   : reserved */
		uint32_t PHYSEL		: 1;	/* Bit 6      : Full Speed serial transceiver select */
		uint32_t reserved_7	: 1;	/* Bit 7      : reserved */
		uint32_t SRPCAP		: 1;	/* Bit 8      : SRP-capable */
		uint32_t HNPCAP		: 1;	/* Bit 9      : HNP-capable */
		uint32_t TRDT		: 4;	/* Bits 13:10 : USB turnaround time */
		uint32_t reserved_28_14 :15;	/* Bits 28:14 : reserved */
		uint32_t FHMOD		: 1;	/* Bit 29     : Force host mode */
		uint32_t FDMOD		: 1; 	/* Bit 30     : Force device mode */
		uint32_t CTXPKT		: 1;	/* Bit 31     : Corrupt Tx packet */
	} b;
} USB_OTG_FS_GUSBCFG_T;

typedef union
{
	uint32_t reg;
	struct
	{
		uint32_t CSRST		: 1;	/* Bit 0      : Core soft reset */
		uint32_t HSRST		: 1;	/* Bit 1      : HCLK soft reset */
		uint32_t FCRST		: 1;	/* Bit 2      : Host frame counter reset */
		uint32_t reserved_3	: 1;	/* Bit 3      : reserved */
		uint32_t RXFFLSH	: 1;	/* Bit 4      : Rx FIFO flush */
		uint32_t TXFFLSH	: 1;	/* Bit 5      : Tx FIFO flush */
		uint32_t TXFNUM		: 5;	/* Bits 10:6  : Tx FIFO number */
		uint32_t reserved_30_11 :20;	/* Bits 30:11 : reserved */
		uint32_t AHBIDL		: 1;	/* Bit 31     : AHB master idle */	
	} b;
} USB_OTG_FS_GRSTCTL_T;

typedef union
{
	uint32_t reg;
	struct
	{
		uint32_t CMOD		: 1;	/* Bit 0      : Current mode of operation */
		uint32_t MMIS		: 1;	/* Bit 1      : Mode mismatch interrupt */
		uint32_t OTGINT		: 1;	/* Bit 2      : OTG interrupt */
		uint32_t SOF		: 1;	/* Bit 3      : Start of frame */
		uint32_t RXFLVL		: 1;	/* Bit 4      : Rx FIFO non-empty */
		uint32_t NPTXFE		: 1;	/* Bit 5      : Non-periodic Tx FIFO empty */
		uint32_t GINAKEFF	: 1;	/* Bit 6      : Global IN non-periodic NAK effective */
		uint32_t GONAKEFF	: 1;	/* Bit 7      : Global OUT NAK effective */
		uint32_t reserved_9_8	: 2;	/* Bits 9:8   : reserved */
		uint32_t ESUSP		: 1;	/* Bit 10     : Early suspend */
		uint32_t USBSUSP	: 1;	/* Bit 11     : USB suspend */
		uint32_t USBRST		: 1;	/* Bit 12     : USB reset */
		uint32_t ENUMDNE	: 1;	/* Bit 13     : Enumeration done */
		uint32_t ISOODRP	: 1;	/* Bit 14     : Isochronous OUT packet dropped interrupt */
		uint32_t EOPF		: 1;	/* Bit 15     : End of periodic frame interrupt */
		uint32_t reserved_17_16 : 2;	/* Bits 17:16 : reserved */
		uint32_t IEPINT		: 1;	/* Bit 18     : IN endpoint interrupt */
		uint32_t OEPINT		: 1;	/* Bit 19     : OUT endpoint interrupt */
		uint32_t IISOIXFR	: 1;	/* Bit 20     : Incomplete isochronous IN transfer */
		uint32_t IPXFR		: 1;	/* Bit 21     : Incomplete periodic transfer */
		uint32_t reserved_23_22 : 2;	/* Bits 23:22 : reserved */
		uint32_t HPRTINT	: 1;	/* Bit 24     : Host port interrupt */
		uint32_t HCINT		: 1;	/* Bit 25     : Host channels interrupt */
		uint32_t PTXFE		: 1;	/* Bit 26     : Periodic Tx FIFO empty */
		uint32_t reserved_27	: 1;	/* Bit 27     : reserved */
		uint32_t CIDSCHG	: 1;	/* Bit 28     : Connector ID status change */
		uint32_t DISCINT	: 1;	/* Bit 29     : Disconnect detect interrupt */
		uint32_t SRQINT		: 1;	/* Bit 30     : Session request/new session detected interrupt */
		uint32_t WKUPINT	: 1;	/* Bit 31     : Resume/remote wakeup detected interrupt */
	} b;
} USB_OTG_FS_GINTSTS_T;

typedef union
{
	uint32_t reg;
	struct
	{
		uint32_t reserved_0	: 1;	/* Bit 0      : reserved */
		uint32_t MMISM		: 1;	/* Bit 1      : Mode mismatch interrupt */
		uint32_t OTGINT		: 1;	/* Bit 2      : OTG interrupt */
		uint32_t SOFM		: 1;	/* Bit 3      : Start of frame */
		uint32_t RXFLVLM	: 1;	/* Bit 4      : Rx FIFO non-empty */
		uint32_t NPTXFEM	: 1;	/* Bit 5      : Non-periodic Tx FIFO empty */
		uint32_t GINAKEFFM	: 1;	/* Bit 6      : Global IN non-periodic NAK effective */
		uint32_t GONAKEFFM	: 1;	/* Bit 7      : Global OUT NAK effective */
		uint32_t reserved_9_8	: 2;	/* Bits 9:8   : reserved */
		uint32_t ESUSPM		: 1;	/* Bit 10     : Early suspend */
		uint32_t USBSUSPM	: 1;	/* Bit 11     : USB suspend */
		uint32_t USBRST		: 1;	/* Bit 12     : USB reset */
		uint32_t ENUMDNEM	: 1;	/* Bit 13     : Enumeration done */
		uint32_t ISOODRPM	: 1;	/* Bit 14     : Isochronous OUT packet dropped interrupt */
		uint32_t EOPFM		: 1;	/* Bit 15     : End of periodic frame interrupt */
		uint32_t reserved_16 	: 1;	/* Bit 16     : reserved */
		uint32_t EPMISM		: 1;	/* Bit 17     : Endpoint mismatch interrupt mask */
		uint32_t IEPINT		: 1;	/* Bit 18     : IN endpoint interrupt */
		uint32_t OEPINT		: 1;	/* Bit 19     : OUT endpoint interrupt */
		uint32_t IISOIXFRM	: 1;	/* Bit 20     : Incomplete isochronous IN transfer */
		uint32_t IPXFRM		: 1;	/* Bit 21     : Incomplete periodic transfer */
		uint32_t reserved_23_22 : 2;	/* Bits 23:22 : reserved */
		uint32_t HPRTIM		: 1;	/* Bit 24     : Host port interrupt */
		uint32_t HCIM		: 1;	/* Bit 25     : Host channels interrupt */
		uint32_t PTXFEM		: 1;	/* Bit 26     : Periodic Tx FIFO empty */
		uint32_t reserved_27	: 1;	/* Bit 27     : reserved */
		uint32_t CIDSCHGM	: 1;	/* Bit 28     : Connector ID status change */
		uint32_t DISCINT	: 1;	/* Bit 29     : Disconnect detect interrupt */
		uint32_t SRQIM		: 1;	/* Bit 30     : Session request/new session detected interrupt */
		uint32_t WUIM		: 1;	/* Bit 31     : Resume/remote wakeup detected interrupt */
	} b;
} USB_OTG_FS_GINTMSK_T;

