plebioda/hdmisnoop/platform/inc/stm32_usb_fs.h
typedef enum
{
	USB_GRXSTSP_PKSTS_GLOBAL_OUT_NAK = 1,
	USB_GRXSTSP_PKSTS_OUT_PACKET_REVEIVED = 2,
	USB_GRXSTSP_PKSTS_OUT_TX_COMPLETED = 3,
	USB_GRXSTSP_PKSTS_SETUP_COMPLETED = 4,
	USB_GRXSTSP_PKSTS_SETUP_PACKET_RECEIVED = 6

} USB_GRXSTSP_PKTSTS_T;

typedef union
{
	uint32_t reg;
	struct 
	{
		uint32_t EPNUM		: 4;	/* Bits 3:0   : Endpoint number*/
		uint32_t BCNT		:11;	/* Bits 14:4  : Byte count */
		uint32_t DPID		: 2;	/* Bits 16:15 : Data PID */
		uint32_t PKTSTS		: 4;	/* Bits 20:17 : Packet status */
		uint32_t FRMNUM		: 4;	/* Bits 24:21 : Frame number */
		uint32_t reserved_31_25 : 7;	/* Bits 31:25 : reserved */
	} b;
} USB_OTG_FS_GRXSTSx_T;

typedef union
{
	uint32_t reg;
	struct
	{
		uint16_t RXFD		:16;	/* Bits 15:0  : Rx FIFO depth */
		uint16_t reserved_31_16 :16;	/* Bits 31:16 : reserved */
	} b;
} USB_OTG_FS_GRXFSIZ_T;

typedef union
{
	uint32_t reg;
	struct
	{
		uint16_t NPTXFD		:16;	/* Bits 15:0  : Non-periodic Tx FIFO depth */
	       	uint16_t NPTXFSA	:16;	/* Bits 31:16 : Non-periodic transmit RAM start address */
	} h;
	struct
	{
		uint16_t TX0FD		:16;	/* Bits 15:0  : Endpoint 0 Tx FIFO depth */
		uint16_t TX0FSA		:16;	/* Bits 31:16 : Endpoint 0 transmit RAM start address */
	} d;
} USB_OTG_FS_HNPTXFSIZ_T;

typedef USB_OTG_FS_HNPTXFSIZ_T USB_OTG_FS_DIEPTXF0_T;

typedef union
{
	uint32_t reg;
	struct
	{
		/* TODO In device mode this register is not valid */
		uint32_t reg;
	} b;
} USB_OTG_FS_HNPTXSTS_T;

typedef union
{
	uint32_t reg;
	struct
	{
		uint32_t reserved_15_0	:16;	/* Bits 15:0  : reserved */
		uint32_t PWRDWN		: 1;	/* Bit 16     : Power Down */
		uint32_t reserved_17	: 1;	/* Bit 17     : reserved */
		uint32_t VBUSASEN	: 1;	/* Bit 18     : Enable the VBus sensing A device */
		uint32_t VBUSBSEN	: 1;	/* Bit 19     : Enable the VBus sensing B device */
		uint32_t SOFOUTEN	: 1;	/* Bit 20     : SOF output enable */
		uint32_t NOVBUSSENS	: 1;	/* Bit 21     : VBus sensing disable option */
		uint32_t reserved_31_22 :10;	/* Bits 31:22 : reserved */
	} b;
} USB_OTG_FS_GCCFG_T;

typedef uint32_t USB_OTG_FS_CID_T;


typedef union
{
	uint32_t reg;
	struct
	{
		uint16_t PTXSA		:16;	/* Bits 15:0  : Host periodic Tx FIFO depth */
	       	uint16_t reserved_31_16 :16;	/* Bits 31:16 : reserved */
	} b;
} USB_OTG_FS_HPTXFSIZ_T;

typedef union
{
	uint32_t reg;
	struct
	{
		uint16_t INEPTXSA	:16;	/* Bits 15:0  : IN endpoint FIFOx transmit RAM start address */
	       	uint16_t INEPTXFD	:16;	/* Bits 31:16 : IN endpoint Tx FIFO depth */
	} b;
} USB_OTG_FS_DIEPTXFx_T;

typedef struct
{
	__IO USB_OTG_FS_GOTGCTL_T 	GOTGCTL;		/* 0x000 : OTG FS control and statur register */
	__IO USB_OTG_FS_GOTGINT_T 	GOTGINT; 		/* 0x004 : OTG FS interrupt register */
	__IO USB_OTG_FS_GAHBCFG_T 	GAHBCFG;		/* 0x008 : OTG FS AHB configuration register */
	__IO USB_OTG_FS_GUSBCFG_T 	GUSBCFG;		/* 0x00C : OTG FS USB configuration register */
	__IO USB_OTG_FS_GRSTCTL_T 	GRSTCTL;		/* 0x010 : OTG FS reset register */
	__IO USB_OTG_FS_GINTSTS_T 	GINTSTS;		/* 0x014 : OTG FS core interrupt register */
	__IO USB_OTG_FS_GINTMSK_T 	GINTMSK;		/* 0x018 : OTG FS interrupt mask register */
	__IO USB_OTG_FS_GRXSTSx_T 	GRXSTSR;		/* 0x01C : OTG FS status read register */
	__IO USB_OTG_FS_GRXSTSx_T 	GRXSTSP;		/* 0x020 : OTG FS status pop register */
	__IO USB_OTG_FS_GRXFSIZ_T 	GRXFSIZ;		/* 0x024 : OTG FS receive FIFO size register */
	__IO USB_OTG_FS_HNPTXFSIZ_T	HNPTXFSIZ;		/* 0x028 : */
#define DIEPTXF0  HNPTXFSIZ	
	__IO USB_OTG_FS_HNPTXSTS_T 	HNPTXSTS;		/* 0x02C : */
	__IO uint32_t 			reserved_0x030;		/* 0x030 : */
	__IO uint32_t 			reserved_0x034;		/* 0x034 : */
	__IO USB_OTG_FS_GCCFG_T 	GCCFG;			/* 0x038 : OTG FS general core configuration register */
	__IO USB_OTG_FS_CID_T 		CID;			/* 0x03C : OTG FS core ID register */
	__IO uint32_t 			reserved_0x040[48];	/* 0x040 : */
	__IO USB_OTG_FS_HPTXFSIZ_T 	HPTXFSIZ;		/* 0x100 : OTG FS host periodic transmit FIFO size register */
	__IO USB_OTG_FS_DIEPTXFx_T 	DIEPTXFx[11];		/* 0x104 : */
} USB_OTG_FS_CGCSR_T;

typedef union
{
	uint32_t reg;
	struct
	{
		uint32_t DSPD		: 2;	/* Bits 1:0   : Device speed */
		uint32_t NZLSOHSK	: 1;	/* Bit 2      : Non-zero-length status OUT handshake */
		uint32_t reserved_3	: 1;	/* Bit 3      : reserved */
		uint32_t DAD		: 7;	/* Bits 10:4  : Device address */
		uint32_t PFIVL		: 2;	/* Bits 12:11 : Periodic frame interval */
		uint32_t reserved_31_13 :19;	/* Bits 31:13 : reserved */
	} b;
} USB_OTG_FS_DCFG_T;

typedef union
{
	uint32_t reg;
	struct
	{
		uint32_t RWUSIG		: 1;	/* Bit 0      : Remote wakeup signalling */
		uint32_t SDIS		: 1;	/* Bit 1      : Soft disconnect */
		uint32_t GINSTS		: 1;	/* Bit 2      : Global IN NAK status */
		uint32_t GONSTS		: 1;	/* Bit 3      : Global OUT NAK status */
		uint32_t TCTL		: 3;	/* Bits 6:4   : Test control */
		uint32_t SGINAK		: 1;	/* Bit 7      : Set global IN NAK */
		uint32_t CGINAK		: 1;	/* Bit 8      : Clear global IN NAK */
		uint32_t SGONAK		: 1;	/* Bit 9      : Set global OUT NAK */
		uint32_t CGONAK		: 1;	/* Bit 10     : Clear global OUT NAK */
		uint32_t POPRGDNE	: 1;	/* Bit 11     : Power-on programming done */
		uint32_t reserved_31_12 :20;	/* Bits 31:12 : reserved */
	} b;
} USB_OTG_FS_DCTL_T;

typedef union
{
	uint32_t reg;
	struct
	{
		uint32_t SUSPSTS	: 1;	/* Bit 0      : Suspend status */
		uint32_t ENUMSPD	: 2;	/* Bits 2:1   : Enumerated speed */
		uint32_t EERR		: 1;	/* Bit 3      : Erratic error */
		uint32_t reserved_7_4	: 4;	/* Bits 7:4   : reserved */
		uint32_t FNSOF		:14;	/* Bits 21:8  : Frame numer of received SOF */
		uint32_t reserved_31_22 :10;	/* Bits 31:22 : reserved */
	} b;
} USB_OTG_FS_DSTS_T;

typedef union
{
	uint32_t reg;
	struct
	{
		uint32_t XFRCM		: 1;	/* Bit 0      : Transfer completed interrupt mask */
		uint32_t EPDM		: 1;	/* Bit 1      : Endpoint disabled interrupt mask */
		uint32_t reserved_2	: 1;	/* Bit 2      : reserved */
		uint32_t TOM		: 1;	/* Bit 3      : Timeout condition mask */
		uint32_t ITTXFEMSK	: 1;	/* Bit 4      : IN token received when Tx FIFO empty mask */
		uint32_t INEPNMM	: 1;	/* Bit 5      : IN token received with EP mismatch mask */
		uint32_t INEPNEM	: 1;	/* Bit 6      : IN endpoint NAK effective maskt */
		uint32_t reserved_31_7	:25;	/* Bits 31:7  : reserved */
	} b;
} USB_OTG_FS_DIEPMSK_T;

typedef union
{
	uint32_t reg;
	struct
	{
		uint32_t XFRCM		: 1;	/* Bit 0      : Transfer completed interrupt mask */
		uint32_t EPDM		: 1;	/* Bit 1      : Endpoint disabled interrupt mask */
		uint32_t reserved_2	: 1;	/* Bit 2      : reserved */
		uint32_t STUPM		: 1;	/* Bit 3      : SETUP phase done mask */
		uint32_t OTEPDM		: 1;	/* Bit 4      : OUT token received when endpoint disabled mask */
		uint32_t reserved_31_5	:27;	/* Bits 31:5  : reserved */
	} b;
} USB_OTG_FS_DOEPMSK_T;

typedef union
{
	uint32_t reg;
	struct
	{
		uint16_t IEPINT		:16;	/* Bits 15:0  : IN endpoint interrupt bits */
		uint16_t OEPINT		:16;	/* Bits 31:16 : OUT endpoint interrupt bits */ 
	} b;
} USB_OTG_FS_DAINT_T;

typedef union
{
	uint32_t reg;
	struct
	{
		uint16_t IEPM		:16;	/* Bits 15:0  : IN endpoint interrupt mask bits */
		uint16_t OEPM		:16;	/* Bits 31:16 : OUT endpoint interrupt mask bits */ 
	} b;
} USB_OTG_FS_DAINTMSK_T;

typedef union
{
	uint32_t reg;
	struct
	{
		uint16_t VBUSDT		:16;	/* Bits 15:0  : VBUS discharge time */
		uint16_t reserved_31_16	:16;	/* Bits 31:16 : reserved */
	} b;
} USB_OTG_FS_DVBUSDIS_T;

typedef union
{
	uint32_t reg;
	struct
	{
		uint32_t DVBUSP		:12;	/* Bits 11:0  : VBUS pulsing time */
		uint32_t reserved_31_12	:20;	/* Bits 31:12 : reserved */
	} b;
} USB_OTG_FS_DVBUSPULS_T;

typedef union
{
	uint32_t reg;
	struct
	{
		uint16_t INEPTXFEM	:16;	/* Bits 15:0  : IN endpoint Tx FIFO empty interrupt mask bits */
		uint16_t reserved_31_16	:16;	/* Bits 31:16 : reserved */
	} b;
} USB_OTG_FS_DIEPEMPMSK_T;

typedef struct
{
	__IO USB_OTG_FS_DCFG_T 		DCFG;			/* 0x800 : OTG FS device configuration register */
	__IO USB_OTG_FS_DCTL_T 		DCTL;			/* 0x804 : OTG FS device control register */
	__IO USB_OTG_FS_DSTS_T 		DSTS;			/* 0x808 : OTG FS device status register */
	__IO uint32_t 			reserved_0x80C;		/* 0x80C : reserved */
	__IO USB_OTG_FS_DIEPMSK_T 	DIEPMSK;		/* 0x810 : OTG FS device IN endpoint common interrupt mask register */
	__IO USB_OTG_FS_DOEPMSK_T 	DOEPMSK;		/* 0x814 : OTG FS device OUT endpoint common interrupt mask register */
	__IO USB_OTG_FS_DAINT_T 	DAINT;			/* 0x818 : OTG FS device all endpoints interrupt register */
	__IO USB_OTG_FS_DAINTMSK_T 	DAINTMSK;		/* 0x81C : OTG FS device all endpoints interrupt mask register */
	__IO uint32_t 			reserved_0x820;		/* 0x820 : reserved */
	__IO uint32_t 			reserved_0x824;		/* 0x824 : reserved */
	__IO USB_OTG_FS_DVBUSDIS_T	DVBUSDIS;		/* 0x828 : OTG FS device VBUS discharge time register */
	__IO USB_OTG_FS_DVBUSPULS_T	DVBUSPULS;		/* 0x82C : OTG FS device VBUS pulsing time register */
	__IO uint32_t 			reserved_0x830;		/* 0x830 : reserved */
	__IO USB_OTG_FS_DIEPEMPMSK_T	DIEPEMPMSK;		/* 0x834 : OTG FS device IN endpoint FIFO empty interrupt mask register */
} USB_OTG_FS_DMCSR_T;

