plebioda/hdmisnoop/platform/inc/stm32_usb_fs.h
#define USB_DIEPCTL_MPSIZ_64	0
#define USB_DIEPCTL_MPSIZ_32	1
#define USB_DIEPCTL_MPSIZ_16	2
#define USB_DIEPCTL_MPSIZ_8	3

typedef union
{
	uint32_t reg;
	struct
	{
		uint32_t MPSIZ		: 2;	/* Bits 1:0    : Maximum packet size */
		uint32_t reserved_14_2	:13;	/* Bits 14:2   : reserved */
		uint32_t USBAEP		: 1;	/* Bit 15      : USB active endpoint */
		uint32_t reserved_16	: 1;	/* Bit 16      : reserved */
		uint32_t NAKSTS		: 1;	/* Bit 17      : NAK status */
		uint32_t EPTYP		: 2;	/* Bits 19:18  : Endpoint type */
		uint32_t reserved_20	: 1;	/* Bit 20      : reserved */
		uint32_t STALL		: 1;	/* Bit 21      : STALL handshake */
		uint32_t TXFNUM		: 4;	/* Bits 25:22  : Tx FIFO number */
		uint32_t CNAK		: 1;	/* Bit 26      : Clear NAK */
		uint32_t SNAK		: 1;	/* Bit 27      : Set NAK */
		uint32_t reserved_29_28 : 2;	/* Bits 29:28  : reserved */
		uint32_t EPDIS		: 1;	/* Bit 30      : Endpoint disable */
		uint32_t EPENA		: 1;	/* Bit 31      : Endpoint enable */
	} b;
} USB_OTG_FS_DIEPCTL0_T;

typedef union
{
	uint32_t reg;
	struct
	{
		uint32_t MPSIZ		:11;	/* Bits 10:0   : Maximum packet size */
		uint32_t reserved_14_2	: 4;	/* Bits 14:2   : reserved */
		uint32_t USBAEP		: 1;	/* Bit 15      : USB active endpoint */
		uint32_t DPID		: 1;	/* Bit 16      : Endpoint data PID [for interrupt/bulk]*/
						/*               Even/Odd frame number [for isochronous]*/
		uint32_t NAKSTS		: 1;	/* Bit 17      : NAK status */
		uint32_t EPTYP		: 2;	/* Bits 19:18  : Endpoint type */
		uint32_t reserved_20	: 1;	/* Bit 20      : reserved */
		uint32_t STALL		: 1;	/* Bit 21      : STALL handshake */
		uint32_t TXFNUM		: 4;	/* Bits 25:22  : Tx FIFO number */
		uint32_t CNAK		: 1;	/* Bit 26      : Clear NAK */
		uint32_t SNAK		: 1;	/* Bit 27      : Set NAK */
		uint32_t SD0PID		: 1;	/* Bit 28      : Set DATA0 PID [for interrupt/bulk] */
						/*               Set even frame [for isochronous] */
		uint32_t SD1PID		: 1;	/* Bit 29      : Set DATA1 PID [for interrupt/bulk] */
						/*               Set odd frame [for isochronous] */
		uint32_t EPDIS		: 1;	/* Bit 30      : Endpoint disable */
		uint32_t EPENA		: 1;	/* Bit 31      : Endpoint enable */
	} b;
} USB_OTG_FS_DIEPCTLx_T;

#define EONUM	DPID
#define SEVNFRM	SD0PID
#define SODDFRM	SD1PID

typedef union
{
	uint32_t reg;
	struct
	{
		uint32_t MPSIZ		: 2;	/* Bits 1:0    : Maximum packet size */
		uint32_t reserved_14_2	:13;	/* Bits 14:2   : reserved */
		uint32_t USBAEP		: 1;	/* Bit 15      : USB active endpoint */
		uint32_t reserved_16	: 1;	/* Bit 16      : reserved */
		uint32_t NAKSTS		: 1;	/* Bit 17      : NAK status */
		uint32_t EPTYP		: 2;	/* Bits 19:18  : Endpoint type */
		uint32_t SNPM		: 1;	/* Bit 20      : Snoop mode */
		uint32_t STALL		: 1;	/* Bit 21      : STALL handshake */
		uint32_t reserved_25_22	: 4;	/* Bits 25:22  : reserved */
		uint32_t CNAK		: 1;	/* Bit 26      : Clear NAK */
		uint32_t SNAK		: 1;	/* Bit 27      : Set NAK */
		uint32_t reserved_29_28 : 2;	/* Bits 29:28  : reserved */
		uint32_t EPDIS		: 1;	/* Bit 30      : Endpoint disable */
		uint32_t EPENA		: 1;	/* Bit 31      : Endpoint enable */
	} b;
} USB_OTG_FS_DOEPCTL0_T;

typedef union
{
	uint32_t reg;
	struct
	{
		uint32_t MPSIZ		:11;	/* Bits 10:0   : Maximum packet size */
		uint32_t reserved_14_11	: 4;	/* Bits 14:2   : reserved */
		uint32_t USBAEP		: 1;	/* Bit 15      : USB active endpoint */
		uint32_t DPID		: 1;	/* Bit 16      : Endpoint data PID [for interrupt/bulk]*/
						/*               Even/Odd frame number [for isochronous]*/
		uint32_t NAKSTS		: 1;	/* Bit 17      : NAK status */
		uint32_t EPTYP		: 2;	/* Bits 19:18  : Endpoint type */
		uint32_t SNMP		: 1;	/* Bit 20      : Snoop mode */
		uint32_t STALL		: 1;	/* Bit 21      : STALL handshake */
		uint32_t reserved_25_22	: 4;	/* Bits 25:22  : Tx FIFO number */
		uint32_t CNAK		: 1;	/* Bit 26      : Clear NAK */
		uint32_t SNAK		: 1;	/* Bit 27      : Set NAK */
		uint32_t SD0PID		: 1;	/* Bit 28      : Set DATA0 PID [for interrupt/bulk] */
						/*               Set even frame [for isochronous] */
		uint32_t SD1PID		: 1;	/* Bit 29      : Set DATA1 PID [for interrupt/bulk] */
						/*               Set odd frame [for isochronous] */
		uint32_t EPDIS		: 1;	/* Bit 30      : Endpoint disable */
		uint32_t EPENA		: 1;	/* Bit 31      : Endpoint enable */
	} b;
} USB_OTG_FS_DOEPCTLx_T;

typedef union
{
	uint32_t reg;
	struct
	{
		uint32_t XFRC		: 1;	/* Bit 0       : Transfer completed interrupt */
		uint32_t EPDISD		: 1;	/* Bit 1       : Endpoint disabled interrupt */
		uint32_t reserved_2	: 1;	/* Bit 2       : reserved */
		uint32_t TOC		: 1;	/* Bit 3       : Timout condition */
		uint32_t ITTXFE		: 1;	/* Bit 4       : IN token received when Tx FIFO is empty */
		uint32_t reserved_5 	: 1;	/* Bit 5       : reserved */
		uint32_t INEPNE		: 1;	/* Bit 6       : IN endpoint NAK effective */
		uint32_t TXFE		: 1;	/* Bit 7       : Transmit FIFO empty */
		uint32_t reserved_31_8	:24;	/* Bits 31:8   : reserved */
	} b;
} USB_OTG_FS_DIEPINTx_T;

typedef union
{
	uint32_t reg;
	struct
	{
		uint32_t XFRC		: 1;	/* Bit 0       : Transfer completed interrupt */
		uint32_t EPDISD		: 1;	/* Bit 1       : Endpoint disabled interrupt */
		uint32_t reserved_2	: 1;	/* Bit 2       : reserved */
		uint32_t STUP		: 1;	/* Bit 3       : SETUP phase done */
		uint32_t OTEPDIS	: 1;	/* Bit 4       : OUT token received when endpoint disabled */
		uint32_t reserved_5 	: 1;	/* Bit 5       : reserved */
		uint32_t B2BSTUP	: 1;	/* Bit 6       : Back-to-Back SETUP packets received */
		uint32_t reserved_31_7	:25;	/* Bits 31:7   : reserved */
	} b;
} USB_OTG_FS_DOEPINTx_T;

typedef union
{
	uint32_t reg;
	struct
	{
		uint32_t XFRSIZ		: 7;	/* Bits 6:0    : Transfer size */
		uint32_t reserved_18_7	:12;	/* Bits 18:7   : reserved */
		uint32_t PKTCNT		: 2;	/* Bits 20:19  : Packet count */
		uint32_t reserved_31_21 :11;	/* Bits 31:21  : reserved */
	} b;
} USB_OTG_FS_DIEPSIZ0_T;

typedef union
{
	uint32_t reg;
	struct
	{
		uint32_t XFRSIZ		: 7;	/* Bits 6:0    : Transfer size */
		uint32_t reserved_18_7	:12;	/* Bits 18:7   : reserved */
		uint32_t PKTCNT		: 1;	/* Bit 19      : Packet count */
		uint32_t reserved_28_20 : 9;	/* Bits 28:20  : reserved */
		uint32_t STUPCNT	: 2;	/* Bits 30:29  : SETUP packet count */
		uint32_t reserved_31	: 1;	/* Bit 31      : reserved */
	} b;
} USB_OTG_FS_DOEPSIZ0_T;

typedef union
{
	uint32_t reg;
	struct
	{
		uint32_t XFRSIZ		:19;	/* Bits 18:0   : Transfer size */
		uint32_t PKTCNT		:10;	/* Bits 28:19  : Packet count */
		uint32_t MCNT		: 2;	/* Bits 30:29  : Multi count */
		uint32_t reserved_31	: 1;	/* Bits 31     : reserved */
	} b;
} USB_OTG_FS_DIEPSIZx_T;

typedef union
{
	uint32_t reg;
	struct
	{
		uint32_t XFRSIZ		:19;	/* Bits 18:0   : Transfer size */
		uint32_t PKTCNT		:10;	/* Bits 28:19  : Packet count */
		uint32_t RXDPID		: 2;	/* Bits 30:29  : Received data PID [isochronous]*/
						/*               SETUP packet count [control]*/
		uint32_t reserved_31	: 1;	/* Bits 31     : reserved */
	} b;
} USB_OTG_FS_DOEPSIZx_T;

//#define STUPCNT	RXDPID

typedef union
{
	uint32_t reg;
	struct
	{
		uint16_t INEPTFSAV	:16;	/* Bits 15:0   : IN endpoint Tx FIFO space available */
		uint32_t reserved_31_16 :16;	/* Bits 31:16  : reserved */
	} b;
} USB_OTG_FS_DTXFSTSx_T;

typedef union
{
	uint32_t reg;
	struct
	{
		uint32_t STPPCLK	: 1;	/* Bit 0       : Stop PHY clock */
		uint32_t GATEHCLK	: 1;	/* Bit 1       : Gate HCLK */
		uint32_t reserved_3_2	: 2;	/* Bits 3:2    : reserved */
		uint32_t PHYSUSP	: 1;	/* Bit 4       : PHY suspended */
		uint32_t reserved_31_5	:27;	/* Bits 31:5   : reserved */
	} b;
} USB_OTG_FS_PCGCCTL_T;

#endif //_STM32_USB_FS_H
